*** Settings ***
Library  BuiltIn
Library  OperatingSystem
Library  Process
Library  String

#-----------------------------------------------------------------------------------------------------------
*** Variables ***
${install_path}  ${CURDIR}/../build/install
#-----------------------------------------------------------------------------------------------------------
*** Keywords ***
Проверка установки
    [Arguments]  ${test_name}=
    # Log To Console  ${test_name}
    Directory Should Exist  ${install_path}
#-----------------------------------------------------------------------------------------------------------
*** Test Cases ***
Тест
    [Template]  Базовый Тест
    Тест

#-----------------------------------------------------------------------------------------------------------
